dwgan/STKNX_ChargeStation/source/drivers/uart/STM32F10XX/include/Stm32F10xx_uart.h
/*****************************************************************************************
* Copy right (C) for *********** company.(2016)
*
* File Name        : Stm32F10xx_uart.h
*
* File Description : header file for the driver of stm32f10xx cpu's uart.
*
* Other Description: this file realizes the driver of Stm32F10xx uart.
*
* Version          : 1.00
*
* Author           : 
*
* Data             : 2016.7.28
*
* Modification Rec.:
*   Modify Data    : 2016.7.28
*   Operator       :
*   Version        : 1.00
*   Action         : Creation.
*
*****************************************************************************************/


#ifndef _STM32F10XX_UART_H_
#define _STM32F10XX_UART_H_

#ifdef __cplusplus
extern "C" {
#endif


#define MAX_UART_DEVICE_NUM                 (5)                                /* Max number of uart device   */

/* Interrupt reason data field position definition */
#define UART_INT_DATA_LEN_POS               (0)                                /* Field of data length        */
#define UART_INT_RX_DATA_POS                (1)                                /* Field of received data      */

/* Uart parameter data field position definition   */
#define UART_DEVICE_ID                      (0)                                /* Field of device type ID     */
#define UART_DEV_NO                         (1)                                /* Field of device No.         */
#define UART_OPERATION_CMD                  (2)                                /* Field of operation command  */
#define UART_BIT_MODE                       (3)                                /* Field of bit mode setting   */
#define UART_COMM_STAT                      (3)                                /* Field of Rx/Tx status       */
#define UART_STOP_BIT_MODE                  (4)                                /* Field of stop mode setting  */
#define UART_PARITY_MODE                    (5)                                /* Field of parity setting     */
#define UART_BAUD_MODE                      (6)                                /* Field of baud rate          */

/* Uart number */
#define UART_1                              (0)
#define UART_2                              (1)
#define UART_3                              (2)
#define UART_4                              (3)
#define UART_5                              (4)

/* Uart base addresses */
#define UART1_BASE                          ((T_UART_MEM_MAP)0x40013800u)      /* Address of base register for Uart1 */
#define UART2_BASE                          ((T_UART_MEM_MAP)0x40004400u)      /* Address of base register for Uart2 */
#define UART3_BASE                          ((T_UART_MEM_MAP)0x40004800u)      /* Address of base register for Uart3 */
#define UART4_BASE                          ((T_UART_MEM_MAP)0x40004C00u)      /* Address of base register for Uart4 */
#define UART5_BASE                          ((T_UART_MEM_MAP)0x40005000u)      /* Address of base register for Uart5 */

/* Uart Register accessors */
#define UARTX_SR(base)                      ((base)->SR)                       /* Address of Status Register    */
#define UARTX_DR(base)                      ((base)->DR)                       /* Address of Data Register      */
#define UARTX_BRR(base)                     ((base)->BRR)                      /* Address of Baud Rate Register */
#define UARTX_CR1(base)                     ((base)->CR1)                      /* Address of Control Register 1 */
#define UARTX_CR2(base)                     ((base)->CR2)                      /* Address of Control Register 1 */
#define UARTX_CR3(base)                     ((base)->CR3)                      /* Address of Control Register 1 */
#define UARTX_GTPR(base)                    ((base)->GTPR)                     /* Address of GTR Register       */

/* Uart Register accessors for each uart */
/* Uart1 */
#define UART1_SR                            UARTX_SR(UART1_BASE)
#define UART1_DR                            UARTX_DR(UART1_BASE)
#define UART1_BRR                           UARTX_BRR(UART1_BASE)
#define UART1_CR1                           UARTX_CR1(UART1_BASE)
#define UART1_CR2                           UARTX_CR2(UART1_BASE)
#define UART1_CR3                           UARTX_CR3(UART1_BASE)
#define UART1_GTPR                          UARTX_GTPR(UART1_BASE)

/* Uart2 */
#define UART2_SR                            UARTX_SR(UART2_BASE)
#define UART2_DR                            UARTX_DR(UART2_BASE)
#define UART2_BRR                           UARTX_BRR(UART2_BASE)
#define UART2_CR1                           UARTX_CR1(UART2_BASE)
#define UART2_CR2                           UARTX_CR2(UART2_BASE)
#define UART2_CR3                           UARTX_CR3(UART2_BASE)
#define UART2_GTPR                          UARTX_GTPR(UART2_BASE)

/* Uart3 */
#define UART3_SR                            UARTX_SR(UART3_BASE)
#define UART3_DR                            UARTX_DR(UART3_BASE)
#define UART3_BRR                           UARTX_BRR(UART3_BASE)
#define UART3_CR1                           UARTX_CR1(UART3_BASE)
#define UART3_CR2                           UARTX_CR2(UART3_BASE)
#define UART3_CR3                           UARTX_CR3(UART3_BASE)
#define UART3_GTPR                          UARTX_GTPR(UART3_BASE)

/* Uart4 */
#define UART4_SR                            UARTX_SR(UART4_BASE)
#define UART4_DR                            UARTX_DR(UART4_BASE)
#define UART4_BRR                           UARTX_BRR(UART4_BASE)
#define UART4_CR1                           UARTX_CR1(UART4_BASE)
#define UART4_CR2                           UARTX_CR2(UART4_BASE)
#define UART4_CR3                           UARTX_CR3(UART4_BASE)
#define UART4_GTPR                          UARTX_GTPR(UART4_BASE)

/* Uart5 */
#define UART5_SR                            UARTX_SR(UART5_BASE)
#define UART5_DR                            UARTX_DR(UART5_BASE)
#define UART5_BRR                           UARTX_BRR(UART5_BASE)
#define UART5_CR1                           UARTX_CR1(UART5_BASE)
#define UART5_CR2                           UARTX_CR2(UART5_BASE)
#define UART5_CR3                           UARTX_CR3(UART5_BASE)
#define UART5_GTPR                          UARTX_GTPR(UART5_BASE)

/* Bit definition for USART_SR register */
#define USART_SR_PE_POS                     (0U)                               
#define USART_SR_PE_MASK                    (0x00000001u)                      /* 0x00000001   */
#define USART_SR_PE                         USART_SR_PE_MASK                   /* Parity Error */
#define USART_SR_FE_POS                     (1U)                               
#define USART_SR_FE_MASK                    (0x00000002u)                      /* 0x00000002    */
#define USART_SR_FE                         USART_SR_FE_MASK                   /* Framing Error */
#define USART_SR_NE_POS                     (2U)                               
#define USART_SR_NE_MASK                    (0x00000004u)                      /* 0x00000004       */
#define USART_SR_NE                         USART_SR_NE_MASK                   /* Noise Error Flag */
#define USART_SR_ORE_POS                    (3U)                               
#define USART_SR_ORE_MASK                   (0x00000008u)                      /* 0x00000008    */
#define USART_SR_ORE                        USART_SR_ORE_MASK                  /* OverRun Error */
#define USART_SR_IDLE_POS                   (4U)                               
#define USART_SR_IDLE_MASK                  (0x00000010u)                      /* 0x00000010         */
#define USART_SR_IDLE                       USART_SR_IDLE_MASK                 /* IDLE line detected */
#define USART_SR_RXNE_POS                   (5U)                               
#define USART_SR_RXNE_MASK                  (0x00000020u)                      /* 0x00000020                   */
#define USART_SR_RXNE                       USART_SR_RXNE_MASK                 /* Read Data Register Not Empty */
#define USART_SR_TC_POS                     (6U)                               
#define USART_SR_TC_MASK                    (0x00000040u)                      /* 0x00000040            */
#define USART_SR_TC                         USART_SR_TC_MASK                   /* Transmission Complete */
#define USART_SR_TXE_POS                    (7U)                               
#define USART_SR_TXE_MASK                   (0x00000080u)                      /* 0x00000080                   */
#define USART_SR_TXE                        USART_SR_TXE_MASK                  /* Transmit Data Register Empty */
#define USART_SR_LBD_POS                    (8U)                               
#define USART_SR_LBD_MASK                   (0x00000100u)                      /* 0x00000100               */
#define USART_SR_LBD                        USART_SR_LBD_MASK                  /* LIN Break Detection Flag */
#define USART_SR_CTS_POS                    (9U)                               
#define USART_SR_CTS_MASK                   (0x00000200u)                      /* 0x00000200 */
#define USART_SR_CTS                        USART_SR_CTS_MASK                  /* CTS Flag   */

#define USART_SR_ERR_MASK                   (0x0000000F)                       /* All kinds of error */


/* Bit definition for USART_DR register */
#define USART_DR_DR_POS                     (0U)                               
#define USART_DR_DR_MASK                    (0x000001FFu)                      /* 0x000001FF */
#define USART_DR_DR                         USART_DR_DR_MASK                   /* Data value */

