dwgan/STKNX_ChargeStation/source/drivers/uart/STM32F10XX/include/Stm32F10xx_uart.h
/* Bit definition for USART_BRR register */
#define USART_BRR_DIV_FRACTION_POS          (0U)                               
#define USART_BRR_DIV_FRACTION_MASK         (0x0000000Fu)                       /* 0x0000000F           */
#define USART_BRR_DIV_FRACTION              (USART_BRR_DIV_FRACTION_MASK)      /* Fraction of USARTDIV */
#define USART_BRR_DIV_MAMTISSA_POS          (4U)                               
#define USART_BRR_DIV_MAMTISSA_MASK         (0x0000FFF0u)                       /* 0x0000FFF0           */
#define USART_BRR_DIV_MAMTISSA              (USART_BRR_DIV_MAMTISSA_MASK)      /* Mantissa of USARTDIV */

/* Bit definition for USART_CR1 register */
#define USART_CR1_SBK_POS                   (0U)                               
#define USART_CR1_SBK_MASK                  (0x00000001u)                      /* 0x00000001 */
#define USART_CR1_SBK                       USART_CR1_SBK_MASK                 /* Send Break */
#define USART_CR1_RWU_POS                   (1U)                               
#define USART_CR1_RWU_MASK                  (0x00000002u)                       /* 0x00000002      */
#define USART_CR1_RWU                       USART_CR1_RWU_MASK                 /* Receiver wakeup */
#define USART_CR1_RE_POS                    (2U)                               
#define USART_CR1_RE_MASK                   (0x00000004u)                      /* 0x00000004      */
#define USART_CR1_RE                        USART_CR1_RE_MASK                  /* Receiver Enable */
#define USART_CR1_TE_POS                    (3U)                               
#define USART_CR1_TE_MASK                   (0x00000008u)                      /* 0x00000008         */
#define USART_CR1_TE                        USART_CR1_TE_MASK                  /* Transmitter Enable */
#define USART_CR1_IDLEIE_POS                (4U)                               
#define USART_CR1_IDLEIE_MASK               (0x00000010u)                      /* 0x00000010            */
#define USART_CR1_IDLEIE                    USART_CR1_IDLEIE_MASK              /* IDLE Interrupt Enable */
#define USART_CR1_RXNEIE_POS                (5U)                               
#define USART_CR1_RXNEIE_MASK               (0x00000020u)                      /* 0x00000020            */
#define USART_CR1_RXNEIE                    USART_CR1_RXNEIE_MASK              /* RXNE Interrupt Enable */
#define USART_CR1_TCIE_POS                  (6U)                               
#define USART_CR1_TCIE_MASK                 (0x00000040u)                      /* 0x00000040                             */
#define USART_CR1_TCIE                      USART_CR1_TCIE_MASK                /* Transmission Complete Interrupt Enable */
#define USART_CR1_TXEIE_POS                 (7U)                               
#define USART_CR1_TXEIE_MASK                (0x00000080u)                      /* 0x00000080          */
#define USART_CR1_TXEIE                     USART_CR1_TXEIE_MASK               /* PE Interrupt Enable */
#define USART_CR1_PEIE_POS                  (8U)                               
#define USART_CR1_PEIE_MASK                 (0x00000100u)                      /* 0x00000100          */
#define USART_CR1_PEIE                      USART_CR1_PEIE_MASK                /* PE Interrupt Enable */
#define USART_CR1_PS_POS                    (9U)                               
#define USART_CR1_PS_MASK                   (0x00000200u)                      /* 0x00000200       */
#define USART_CR1_PS                        USART_CR1_PS_MASK                  /* Parity Selection */
#define USART_CR1_PCE_POS                   (10U)                              
#define USART_CR1_PCE_MASK                  (0x00000400u)                      /* 0x00000400            */
#define USART_CR1_PCE                       USART_CR1_PCE_MASK                 /* Parity Control Enable */
#define USART_CR1_WAKE_POS                  (11U)                              
#define USART_CR1_WAKE_MASK                 (0x00000800u)                      /* 0x00000800    */
#define USART_CR1_WAKE                      USART_CR1_WAKE_MASK                /* Wakeup method */
#define USART_CR1_M_POS                     (12U)                              
#define USART_CR1_M_MASK                    (0x00001000u)                      /* 0x00001000  */
#define USART_CR1_M                         USART_CR1_M_MASK                   /* Word length */
#define USART_CR1_UE_POS                    (13U)                              
#define USART_CR1_UE_MASK                   (0x00002000u)                      /* 0x00002000   */
#define USART_CR1_UE                        USART_CR1_UE_MASK                  /* USART Enable */

/* Bit definition for USART_CR2 register */
#define USART_CR2_ADD_POS                   (0U)                               
#define USART_CR2_ADD_MASK                  (0x0000000Fu)                      /* 0x0000000F                */
#define USART_CR2_ADD                       USART_CR2_ADD_MASK                 /* Address of the USART node */
#define USART_CR2_LBDL_POS                  (5U)                               
#define USART_CR2_LBDL_MASK                 (0x00000020u)                      /* 0x00000020                 */
#define USART_CR2_LBDL                      USART_CR2_LBDL_MASK                /* LIN Break Detection Length */
#define USART_CR2_LBDIE_POS                 (6U)                               
#define USART_CR2_LBDIE_MASK                (0x00000040u)                      /* 0x00000040                           */
#define USART_CR2_LBDIE                     USART_CR2_LBDIE_MASK               /* LIN Break Detection Interrupt Enable */
#define USART_CR2_LBCL_POS                  (8U)                               
#define USART_CR2_LBCL_MASK                 (0x00000100u)                      /* 0x00000100           */
#define USART_CR2_LBCL                      USART_CR2_LBCL_MASK                /* Last Bit Clock pulse */
#define USART_CR2_CPHA_POS                  (9U)                               
#define USART_CR2_CPHA_MASK                 (0x00000200u)                      /* 0x00000200  */
#define USART_CR2_CPHA                      USART_CR2_CPHA_MASK                /* Clock Phase */
#define USART_CR2_CPOL_POS                  (10U)                              
#define USART_CR2_CPOL_MASK                 (0x00000400u)                      /* 0x00000400     */
#define USART_CR2_CPOL                      USART_CR2_CPOL_MASK                /* Clock Polarity */
#define USART_CR2_CLKEN_POS                 (11U)                              
#define USART_CR2_CLKEN_MASK                (0x00000800u)                      /* 0x00000800   */
#define USART_CR2_CLKEN                     USART_CR2_CLKEN_MASK               /* Clock Enable */

#define USART_CR2_STOP_POS                  (12U)                              
#define USART_CR2_STOP_MASK                 (0x00003000u)                       /* 0x00003000                 */
#define USART_CR2_STOP                      (USART_CR2_STOP_MASK)              /* STOP[1:0] bits (STOP bits) */
#define USART_CR2_STOP_0                    (0x00001000u)                       /* 0x00001000                 */
#define USART_CR2_STOP_1                    (0x00002000u)                       /* 0x00002000                 */

#define USART_CR2_STOP_ONE_BIT              (0x00000000u)                       /* 0x00000000 */
#define USART_CR2_STOP_HALF_BIT             (0x00001000u)                       /* 0x00001000 */
#define USART_CR2_STOP_TWO_BIT              (0x00002000u)                       /* 0x00002000 */
#define USART_CR2_STOP_ONE_HALF_BIT         (0x00003000u)                       /* 0x00003000 */

#define USART_CR2_LINEN_POS                 (14U)                              
#define USART_CR2_LINEN_MASK                (0x00004000u)                      /* 0x00004000      */
#define USART_CR2_LINEN                     USART_CR2_LINEN_MASK               /* LIN mode enable */

/* Bit definition for USART_CR3 register */
#define USART_CR3_EIE_POS                   (0U)                               
#define USART_CR3_EIE_MASK                  (0x00000001u)                      /* 0x00000001             */
#define USART_CR3_EIE                       USART_CR3_EIE_MASK                 /* Error Interrupt Enable */
#define USART_CR3_IREN_POS                  (1U)                               
#define USART_CR3_IREN_MASK                 (0x00000002u)                      /* 0x00000002       */
#define USART_CR3_IREN                      USART_CR3_IREN_MASK                /* IrDA mode Enable */
#define USART_CR3_IRLP_POS                  (2U)                               
#define USART_CR3_IRLP_MASK                 (0x00000004u)                      /* 0x00000004     */
#define USART_CR3_IRLP                      USART_CR3_IRLP_MASK                /* IrDA Low-Power */
#define USART_CR3_HDSEL_POS                 (3U)                               
#define USART_CR3_HDSEL_MASK                (0x00000008u)                      /* 0x00000008            */
#define USART_CR3_HDSEL                     USART_CR3_HDSEL_MASK               /* Half-Duplex Selection */
#define USART_CR3_NACK_POS                  (4U)                               
#define USART_CR3_NACK_MASK                 (0x00000010u)                      /* 0x00000010            */
#define USART_CR3_NACK                      USART_CR3_NACK_MASK                /* Smartcard NACK enable */
#define USART_CR3_SCEN_POS                  (5U)                               
#define USART_CR3_SCEN_MASK                 (0x00000020u)                      /* 0x00000020            */
#define USART_CR3_SCEN                      USART_CR3_SCEN_MASK                /* Smartcard mode enable */
#define USART_CR3_DMAR_POS                  (6U)                               
#define USART_CR3_DMAR_MASK                 (0x00000040u)                      /* 0x00000040            */
#define USART_CR3_DMAR                      USART_CR3_DMAR_MASK                /* DMA Enable Receiver   */
#define USART_CR3_DMAT_POS                  (7U)                               
#define USART_CR3_DMAT_MASK                 (0x00000080u)                      /* 0x00000080             */
#define USART_CR3_DMAT                      USART_CR3_DMAT_MASK                /* DMA Enable Transmitter */
#define USART_CR3_RTSE_POS                  (8U)                               
#define USART_CR3_RTSE_MASK                 (0x00000100u)                      /* 0x00000100 */
#define USART_CR3_RTSE                      USART_CR3_RTSE_MASK                /* RTS Enable */
#define USART_CR3_CTSE_POS                  (9U)                               
#define USART_CR3_CTSE_MASK                 (0x00000200u)                      /* 0x00000200 */
#define USART_CR3_CTSE                      USART_CR3_CTSE_MASK                /* CTS Enable */
#define USART_CR3_CTSIE_POS                 (10U)                              
#define USART_CR3_CTSIE_MASK                (0x00000400u)                      /* 0x00000400           */
#define USART_CR3_CTSIE                     USART_CR3_CTSIE_MASK               /* CTS Interrupt Enable */

