dwgan/STKNX_ChargeStation/source/drivers/uart/STM32F10XX/include/Stm32F10xx_uart.h
/* Bit definition for USART_GTPR register */
#define USART_GTPR_PSC_POS                  (0U)                               
#define USART_GTPR_PSC_MASK                 (0x000000FFu)                       /* 0x000000FF                      */
#define USART_GTPR_PSC                      (USART_GTPR_PSC_MASK)              /* PSC[7:0] bits (Prescaler value) */
#define USART_GTPR_PSC_0                    (0x00000001u)                       /* 0x00000001 */
#define USART_GTPR_PSC_1                    (0x00000002u)                       /* 0x00000002 */
#define USART_GTPR_PSC_2                    (0x00000004u)                       /* 0x00000004 */
#define USART_GTPR_PSC_3                    (0x00000008u)                       /* 0x00000008 */
#define USART_GTPR_PSC_4                    (0x00000010u)                       /* 0x00000010 */
#define USART_GTPR_PSC_5                    (0x00000020u)                       /* 0x00000020 */
#define USART_GTPR_PSC_6                    (0x00000040u)                       /* 0x00000040 */
#define USART_GTPR_PSC_7                    (0x00000080u)                       /* 0x00000080 */

#define USART_GTPR_GT_POS                   (8U)                                
#define USART_GTPR_GT_MASK                  (0x0000FF00)                       /* 0x0000FF00       */
#define USART_GTPR_GT                       (USART_GTPR_GT_MASK)               /* Guard time value */




/* Data structure definition */
/****************************************************
*   Structure£º  T_UART_MEM_MAP
*   Description£ºMemory map of uart registers.
*   Parameter:   WORD32 SR          Uart status register                  
*                WORD32 DR          Uart data register                    
*                WORD32 BRR         Uart baud rate register               
*                WORD32 CR1         Uart control register 1               
*                WORD32 CR2         Uart control register 2               
*                WORD32 CR3         Uart control register 3               
*                WORD32 GTPR        Uart guard time and prescaler register
*   Authour£º    Ian
*   Modify record:
*   Date:  2016-7-25 creat.
****************************************************/
typedef struct _T_UART_MEM_MAP
{
    WORD32 SR;         /* Uart status register                   */
    WORD32 DR;         /* Uart data register                     */
    WORD32 BRR;        /* Uart baud rate register                */
    WORD32 CR1;        /* Uart control register 1                */
    WORD32 CR2;        /* Uart control register 2                */
    WORD32 CR3;        /* Uart control register 3                */
    WORD32 GTPR;       /* Uart guard time and prescaler register */
}volatile *T_UART_MEM_MAP;




/* Declaration of functions */
/**************************************************************************
* Funciton: void Uart_Reg(BYTE ucLogNo, BYTE ucDevNo, VOID *ptPara)
* Descrip.: Register Uart
* Input   : BYTE ucLogNo      Device logic No.
*           BYTE ucDevNo      Device physical No.
*           VOID *ptPara      None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/31       V1.0         Ian          Create 
**************************************************************************/
void Uart_Reg(BYTE ucLogNo, BYTE ucDevNo, VOID *ptPara);


/**************************************************************************
* Funciton: void Uart1_isr(void)
* Descrip.: interrupt process function of uart1
* Input   : None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/26       V1.0         Ian          Create 
**************************************************************************/
void Uart1_isr(void);

/**************************************************************************
* Funciton: void Uart2_isr(void)
* Descrip.: interrupt process function of uart2
* Input   : None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/26       V1.0         Ian          Create 
**************************************************************************/
void Uart2_isr(void);

/**************************************************************************
* Funciton: void Uart3_isr(void)
* Descrip.: interrupt process function of uart3
* Input   : None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/26       V1.0         Ian          Create 
**************************************************************************/
void Uart3_isr(void);


/**************************************************************************
* Funciton: void Uart4_isr(void)
* Descrip.: interrupt process function of uart4
* Input   : None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/26       V1.0         Ian          Create 
**************************************************************************/
void Uart4_isr(void);

/**************************************************************************
* Funciton: void Uart5_isr(void)
* Descrip.: interrupt process function of uart5
* Input   : None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/26       V1.0         Ian          Create 
**************************************************************************/
void Uart5_isr(void);


#ifdef __cplusplus
}
#endif

#endif /* _STM32F10XX_UART_H_ */



